Hi @pvbouwel, Thank you for working on this!

Regarding the import test failing, I can reproduce it on CI and my local environment.
https://github.com/minamijoyo/tfmigrate/actions/runs/3525880120/jobs/5936550407


```
--- FAIL: TestAccTerraformCLIImport (2.17s)
    terraform_import_test.go:201: failed to run terraform plan after import (expected no diff): failed to run command (exited 2): terraform plan -state=/tmp/tmp2286996446 -out=/tmp/tfplan908721291 -input=false -no-color -detailed-exitcode
        stdout:
        Refreshing Terraform state in-memory prior to plan...
        The refreshed state will be used to calculate this plan, but will not be
        persisted to local or remote state storage.
        
        time_static.foo: Refreshing state... [id=2022-11-24T01:39:13Z]
        
        ------------------------------------------------------------------------
        
        An execution plan has been generated and is shown below.
        Resource actions are indicated with the following symbols:
        -/+ destroy and then create replacement
        
        Terraform will perform the following actions:
        
          # time_static.foo must be replaced
        -/+ resource "time_static" "foo" {
              ~ day      = 24 -> (known after apply)
              ~ hour     = 1 -> (known after apply)
              ~ id       = "2022-11-24T01:39:13Z" -> (known after apply)
              ~ minute   = 39 -> (known after apply)
              ~ month    = 11 -> (known after apply)
              ~ rfc3339  = "2022-11-24T01:39:13Z" -> (known after apply)
              ~ second   = 13 -> (known after apply)
              - triggers = {} -> null # forces replacement
              ~ unix     = 1669253953 -> (known after apply)
              ~ year     = 2022 -> (known after apply)
            }
        
        Plan: 1 to add, 0 to change, 1 to destroy.
```

I confirmed that the test could be passed when the time provider is pinned to v0.8.0.
 
```diff
diff --git a/tfexec/terraform_import_test.go b/tfexec/terraform_import_test.go
index 89a50ee..3dfc425 100644
--- a/tfexec/terraform_import_test.go
+++ b/tfexec/terraform_import_test.go
@@ -159,7 +159,15 @@ func TestTerraformCLIImport(t *testing.T) {
 func TestAccTerraformCLIImport(t *testing.T) {
        SkipUnlessAcceptanceTestEnabled(t)

-       source := `resource "time_static" "foo" {}`
+       source := `
+terraform {
+  required_providers {
+    time = "0.8.0"
+  }
+}
+
+resource "time_static" "foo" {}
+`
```

I guess it was caused by this change. I will look into this a bit more.
https://github.com/hashicorp/terraform-provider-time/pull/112
